## Production: network
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 10 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                           |
|--------|----------------------------------------------------------|
| add    | `aws_security_group.api_ecs[0]`                          |
|        | `aws_security_group_rule.api_ecs_egress_db[0]`           |
|        | `aws_security_group_rule.api_ecs_egress_internet[0]`     |
|        | `aws_security_group_rule.api_ecs_egress_privatelink[0]`  |
|        | `aws_security_group_rule.api_ecs_egress_redis[0]`        |
|        | `aws_security_group_rule.api_ecs_ingress_lb[0]`          |
|        | `aws_security_group_rule.db_ingress_api_ecs[0]`          |
|        | `aws_security_group_rule.lb_egress_api_ecs[0]`           |
|        | `aws_security_group_rule.privatelink_api_ecs_ingress[0]` |
|        | `aws_security_group_rule.redis_ingress_api_ecs[0]`       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.api_ecs[0] will be created
  + resource "aws_security_group" "api_ecs" {
      + arn                    = (known after apply)
      + description            = "API ECS Tasks"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "api_ecs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + vpc_id                 = "vpc-0e852a6f3554a8bca"
    }

  # aws_security_group_rule.api_ecs_egress_db[0] will be created
  + resource "aws_security_group_rule" "api_ecs_egress_db" {
      + description              = "Egress from API ECS task to database"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0603a6edcc9e34d98"
      + to_port                  = 5432
      + type                     = "egress"
    }

  # aws_security_group_rule.api_ecs_egress_internet[0] will be created
  + resource "aws_security_group_rule" "api_ecs_egress_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress from API ECS task to internet (HTTPS)"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.api_ecs_egress_privatelink[0] will be created
  + resource "aws_security_group_rule" "api_ecs_egress_privatelink" {
      + description              = "Egress from API ECS task to PrivateLink endpoints"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0799d12ff9d17bded"
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.api_ecs_egress_redis[0] will be created
  + resource "aws_security_group_rule" "api_ecs_egress_redis" {
      + description              = "Egress from API ECS task to Redis"
      + from_port                = 6379
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0388290614e570375"
      + to_port                  = 6379
      + type                     = "egress"
    }

  # aws_security_group_rule.api_ecs_ingress_lb[0] will be created
  + resource "aws_security_group_rule" "api_ecs_ingress_lb" {
      + description              = "Ingress from load balancer to API ECS task"
      + from_port                = 3001
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-01b5880f792f4ec91"
      + to_port                  = 3001
      + type                     = "ingress"
    }

  # aws_security_group_rule.db_ingress_api_ecs[0] will be created
  + resource "aws_security_group_rule" "db_ingress_api_ecs" {
      + description              = "Ingress to database from API ECS task"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0603a6edcc9e34d98"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # aws_security_group_rule.lb_egress_api_ecs[0] will be created
  + resource "aws_security_group_rule" "lb_egress_api_ecs" {
      + description              = "Egress from load balancer to API ECS task"
      + from_port                = 3001
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-01b5880f792f4ec91"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3001
      + type                     = "egress"
    }

  # aws_security_group_rule.privatelink_api_ecs_ingress[0] will be created
  + resource "aws_security_group_rule" "privatelink_api_ecs_ingress" {
      + description              = "Security group rule for API ECS task ingress"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0799d12ff9d17bded"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.redis_ingress_api_ecs[0] will be created
  + resource "aws_security_group_rule" "redis_ingress_api_ecs" {
      + description              = "Ingress to Redis from API ECS task"
      + from_port                = 6379
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0388290614e570375"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 6379
      + type                     = "ingress"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ api_ecs_security_group_id        = null -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_default_network_acl.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_default_security_group.default"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.forms_natgw[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.forms_natgw[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.forms_natgw[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_flow_log.vpc_flow_logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_internet_gateway.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.forms[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.forms[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.forms[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.forms_private_subnet[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.forms_private_subnet[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.forms_private_subnet[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.forms_public_subnet"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.api_ecs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.connector_db"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms_database"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms_egress"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms_load_balancer"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms_redis"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.idp_db[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.idp_ecs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.idp_lb[0]"]
WARN - plan.json - main - Missing Common...
```

</details>
